loc and i loc

In [131]:
import pandas as pd

In [132]:
df = pd.read_csv("C:\\Users\\RAJA\\Downloads\\sample.csv", index_col=['Roll No.'])
df.head()

          Physics  Chemistry  Maths  Computer
Roll No.
1            56.0       57.0   58.0      59.0
2            23.0       24.0   25.0      26.0
3            89.0       25.0   26.0      27.0
4            45.0       26.0   27.0      28.0
5            23.0       27.0   28.0      29.0

In [133]:
df.loc[1]

Physics      56.0
Chemistry    57.0
Maths        58.0
Computer     59.0
Name: 1, dtype: float64

In [134]:
df.loc[2]

Physics      23.0
Chemistry    24.0
Maths        25.0
Computer     26.0
Name: 2, dtype: float64

In [135]:
df.loc[[5,6,7,8]]

          Physics  Chemistry  Maths  Computer
Roll No.
5            23.0       27.0   28.0      29.0
6            90.0        NaN   29.0      30.0
7            12.0       13.0   14.0      15.0
8            78.0       14.0   15.0      16.0

In [136]:
df.loc[5:15,'Chemistry']

Roll No.
5     27.0
6      NaN
7     13.0
8     14.0
9     15.0
10    16.0
11    17.0
12     NaN
13    23.0
14     NaN
15    43.0
Name: Chemistry, dtype: float64

In [137]:
df.loc[df['Physics']<50]

          Physics  Chemistry  Maths  Computer
Roll No.
2            23.0       24.0   25.0      26.0
4            45.0       26.0   27.0      28.0
5            23.0       27.0   28.0      29.0
7            12.0       13.0   14.0      15.0
10           45.0       16.0   17.0      18.0
13           22.0       23.0   24.0      25.0
16           44.0       44.0   44.0      44.0
17           45.0       45.0   45.0      45.0
18           46.0       46.0   46.0      46.0
19           47.0       47.0   47.0      47.0
20           48.0       48.0   48.0      48.0
21           49.0       49.0   49.0      49.0

In [138]:
df.loc[df['Physics']>80]

          Physics  Chemistry  Maths  Computer
Roll No.
3            89.0       25.0   26.0      27.0
6            90.0        NaN   29.0      30.0
12           88.0        NaN   19.0      20.0
14           90.0        NaN    NaN      42.0

In [139]:
df.loc[df['Physics']>80, ['Maths']]

          Maths
Roll No.
3          26.0
6          29.0
12         19.0
14          NaN

df.iloc[0]

In [140]:
df.iloc[0]

Physics      56.0
Chemistry    57.0
Maths        58.0
Computer     59.0
Name: 1, dtype: float64

In [141]:
df.iloc[[0,1,2]]

          Physics  Chemistry  Maths  Computer
Roll No.
1            56.0       57.0   58.0      59.0
2            23.0       24.0   25.0      26.0
3            89.0       25.0   26.0      27.0

In [142]:
df.iloc[:,0]

Roll No.
1     56.0
2     23.0
3     89.0
4     45.0
5     23.0
6     90.0
7     12.0
8     78.0
9      NaN
10    45.0
11     NaN
12    88.0
13    22.0
14    90.0
15     NaN
16    44.0
17    45.0
18    46.0
19    47.0
20    48.0
21    49.0
22    50.0
23    51.0
24    52.0
25    53.0
26    54.0
27    55.0
28    56.0
29    57.0
30    58.0
Name: Physics, dtype: float64

In [143]:
df.iloc[0:5,1:4]

          Chemistry  Maths  Computer
Roll No.
1              57.0   58.0      59.0
2              24.0   25.0      26.0
3              25.0   26.0      27.0
4              26.0   27.0      28.0
5              27.0   28.0      29.0